nxp-mcuxpresso/mcuxsdk-examples/_boards/imx943evk/digital_encoder_examples/biss/pin_mux.h
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

#include "fsl_iomuxc.h"
#include "board.h"

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);  /* Function assigned for the Cortex-M33 */

/*!
 * @brief Configures pin routing for digital encoder 1.
 *
 */
void BOARD_InitEncoder1Pins(void);

/*!
 * @brief Configures pin routing for digital encoder 2.
 *
 */
void BOARD_InitEncoder2Pins(void);

/*!
 * @brief Configures pin routing for I2C for pin MUX.
 *
 */
void BOARD_InitI2C6Pins(void);

/*!
 * @brief Configures pin routing for PWM1.
 *
 */
void BOARD_InitIPWM1(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
